#include <iostream>
#include <clocale>
using namespace std;
int main() {
    setlocale(LC_ALL, "Russian");       // для поддержки русского языка
    cout << "Повышенный уровень. Меню ресторана\n";
    int category;                           // Переменная для выбора категории меню
    int dish;                              // Переменная для выбора блюда
    cout << "Меню ресторана\n";
    cout << "1. Салаты\n";
    cout << "2. Горячие блюда\n";
    cout << "3. Напитки\n";
    cout << "Выберите категорию (1-3): ";
    cin >> category;
    switch (category) {                 // Внешний switch для выбора категории
    case 1:                             // если выбрали 1
        cout << "Салаты \n";
        cout << "1. Цезарь — 350 руб.\n";
        cout << "2. Греческий — 300 руб.\n";
        cout << "Выберите блюдо (1-2): \n";
        cin >> dish;
        switch (dish) {                              // вложенный switch для выбора блюда
        case 1:
            cout << "Вы заказали: Цезарь. К оплате: 350 руб.";
            break;
        case 2:
            cout << "Вы заказали: Греческий. К оплате: 300 руб.";
            break;
        default:                                          //если ничего не подошло
            cout << "Ошибка: Такого блюда нет!";
            break;
        }
        break;                    //выход из категории 1

    case 2:                                              // если выбрали 2
        cout << "Горячие блюда \n";
        cout << "1. Паста — 450 руб.\n";
        cout << "2. Стейк — 650 руб.\n";
        cout << "Выберите блюдо (1-2): ";
        cin >> dish;
        switch (dish) {                                             // Вложенный switch для выбора блюда
        case 1:
            cout << "Вы заказали: Паста. К оплате: 450 руб.";
            break;
        case 2:
            cout << "Вы заказали: Стейк. К оплате: 650 руб.";
            break;
        default:                                                      //если ничего не подошло
            cout << "Ошибка: Такого блюда нет!";
            break;
        }
        break;             //выход из второй категории

    case 3:                                                     //если выбрали 3
        cout << "Напитки \n";
        cout << "1. Капучино — 180 руб.\n";
        cout << "2. Лимонад — 150 руб.\n";
        cout << "Выберите блюдо (1-2): ";
        cin >> dish;
        switch (dish) {
        case 1:
            cout << "Вы заказали: Капучино. К оплате: 180 руб.\n";
            break;
        case 2:
            cout << "\nВы заказали: Лимонад. К оплате: 150 руб.\n";
            break;
        default:                                                  //если ничего не подошло
            cout << "\nОшибка: Такого блюда нет!";
            break;
        }
        break;                                      // Выход из категории 3

    default:                                        // если ничего не подошло
        cout << "\nОшибка: Неверная категория меню!" << endl;
        break;
    }

    return 0;
}
